#sample test--------------------
#1------------------------------
pchisq(7*7*7/25, 7) - pchisq(63/25, 7)

#2-----------------------------

#3-----------------------------
n <- 120
p <- 2/3
z <- qnorm(0.975)
print(c(p-z*sqrt(p*(1-p)/n), p+z*sqrt(p*(1-p)/n)))

#4---------------------------
x <- c(6.1, 4.8, 5.6, 3.9, 6.2, 5.9, 5.2, 5.7)
n <- length(x)
m <- mean(x)
s < sd(x)
t <- (m-5)/s/sqrt(n)
t1 <- qt(0.975, 7)
if (t > t1) {
  print('기각한다')
} else {
  ('기각하지않는다')
}
pvalue <- 1-pt(t,n-1)
print(pvalue)

#6------------------------
x <- c(13,14,16,19,18,14,12)
s <- sd(x)
print(s)
n <- 7
print(c(s*sqrt((n-1)/qchisq(0.975,n-1)),s*sqrt((n-1)/qchisq(0.025,n-1))))



#8------------------------
n1=80
m1=78.4
s1=9.1
n2=120
m2=82.3
s2=8.5
z=(m2-m1)/sqrt(s1^2/n1 + s2^2/n2)
print(z)
z0=qnorm(0.975)
print(z0)
a=(m2-m1)-z0*sqrt(s1^2/n1 + s2^2/n2)
b=(m2-m1)+z0*sqrt(s1^2/n1 + s2^2/n2)
print(c(a,b))

#7------------------
32.56-21.84
s <- 10.72*sqrt(28)/(qt(0.95,27)*2)
print(s)
c(s*sqrt(27/qchisq(0.975, 27)),s*sqrt(27/qchisq(0.025, 27)))
if (s < 20) {
  print('기각한다')
} else {
  ('기각하지않는다')
}




#9----------------------
n1 <- 6
m1 <- 43.2
s1 <- 6.2
n2 <- 6
m2 <- 54.7
s2 <- 7.4
sp <- sqrt((5*(s1^2)+5*(s2^2))/(n1+n2-2))
print(sp)
t <- (m1-m2)/(sp*sqrt(1/n1+1/n2))
print(t)
pvalue = pt(t,n1+n2-2)
print(pvalue)



